http/vz.log
httperf --timeout=5 --client=0/1 --server=bbbvz.uvanet.br --port=80 --uri=/index.html --rate=200 --send-buffer=4096 --recv-buffer=16384 --num-conns=5000 --num-calls=10
Maximum connect burst length: 1

Total: connections 5000 requests 50000 replies 50000 test-duration 24.999 s

Connection rate: 200.0 conn/s (5.0 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 2.8 avg 3.1 max 5.1 median 3.5 stddev 0.1
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 10.000

Request rate: 2000.0 req/s (0.5 ms/req)
Request size [B]: 78.0

Reply rate [replies/s]: min 1999.3 avg 1999.9 max 2000.1 stddev 0.3 (5 samples)
Reply time [ms]: response 0.2 transfer 0.1
Reply size [B]: header 284.0 content 6134.0 footer 0.0 (total 6418.0)
Reply status: 1xx=0 2xx=50000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 6.01 system 18.98 (user 24.0% system 75.9% total 100.0%)
Net I/O: 12687.8 KB/s (103.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=bbbvz.uvanet.br --port=80 --uri=/index.html --rate=500 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=10
Maximum connect burst length: 4

Total: connections 10000 requests 100000 replies 100000 test-duration 20.003 s

Connection rate: 499.9 conn/s (2.0 ms/conn, <=7 concurrent connections)
Connection time [ms]: min 2.8 avg 3.4 max 11.4 median 3.5 stddev 0.2
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 10.000

Request rate: 4999.3 req/s (0.2 ms/req)
Request size [B]: 78.0

Reply rate [replies/s]: min 4998.3 avg 4999.4 max 5000.2 stddev 0.8 (4 samples)
Reply time [ms]: response 0.2 transfer 0.1
Reply size [B]: header 284.0 content 6134.0 footer 0.0 (total 6418.0)
Reply status: 1xx=0 2xx=100000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.25 system 17.74 (user 11.2% system 88.7% total 99.9%)
Net I/O: 31714.5 KB/s (259.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=bbbvz.uvanet.br --port=80 --uri=/index.html --rate=500 --send-buffer=4096 --recv-buffer=16384 --num-conns=10000 --num-calls=10
Maximum connect burst length: 1

Total: connections 10000 requests 100000 replies 100000 test-duration 20.004 s

Connection rate: 499.9 conn/s (2.0 ms/conn, <=51 concurrent connections)
Connection time [ms]: min 3.0 avg 6.5 max 258.6 median 4.5 stddev 12.4
Connection time [ms]: connect 0.3
Connection length [replies/conn]: 10.000

Request rate: 4999.0 req/s (0.2 ms/req)
Request size [B]: 78.0

Reply rate [replies/s]: min 4996.4 avg 4999.2 max 5001.8 stddev 2.2 (4 samples)
Reply time [ms]: response 0.5 transfer 0.2
Reply size [B]: header 284.0 content 6134.0 footer 0.0 (total 6418.0)
Reply status: 1xx=0 2xx=100000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.05 system 17.93 (user 10.3% system 89.6% total 99.9%)
Net I/O: 31712.2 KB/s (259.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --timeout=5 --client=0/1 --server=bbbvz.uvanet.br --port=80 --uri=/index.html --rate=500 --send-buffer=4096 --recv-buffer=16384 --num-conns=20000 --num-calls=10
Maximum connect burst length: 1

Total: connections 20000 requests 200000 replies 200000 test-duration 40.003 s

Connection rate: 500.0 conn/s (2.0 ms/conn, <=271 concurrent connections)
Connection time [ms]: min 2.8 avg 43.6 max 3005.7 median 3.5 stddev 344.8
Connection time [ms]: connect 40.3
Connection length [replies/conn]: 10.000

Request rate: 4999.6 req/s (0.2 ms/req)
Request size [B]: 78.0

Reply rate [replies/s]: min 4463.3 avg 4999.6 max 5536.2 stddev 286.7 (8 samples)
Reply time [ms]: response 0.2 transfer 0.1
Reply size [B]: header 284.0 content 6134.0 footer 0.0 (total 6418.0)
Reply status: 1xx=0 2xx=200000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.74 system 35.23 (user 11.9% system 88.1% total 99.9%)
Net I/O: 31716.3 KB/s (259.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0